/* 0. <codeStyle.編碼風格>.慣用:
 * 0.1. 關鍵字: 不區分大小寫, 慣用全大寫
 * 0.2. 表格名: 採大駝峰
 * 0.3. 欄位名稱: 全小寫, 單詞以 _ 連接、分隔單字 (搭配 myBatis)
 * 0.4. 其他名稱: 採小駝峰, <分類別><名稱>, 如函數、程序等
 */

/* prepared statemnet 預制述句 */
-- ==========================================================================
-- --------------------------------------------------------------------------

-- 預制述句.管理 ==========================================================================
SELECT * FROM sys.user_summary ;
SELECT * FROM sys.user_summary WHERE user = "root";

/* 預制述句.管理.建立. --------------------------------------------------------------------------
 * PREPARE <預制述句名稱> FROM <預制述句> ;
 * 
 * 在 <預制述句> 中, 使用 {佔位符}: 用 ? (問號)表示
 */
PREPARE preStmt FROM "SELECT * FROM sys.user_summary" ;
PREPARE preStmt FROM "SELECT * FROM sys.user_summary WHERE user = ?" ;

-- 預制述句.管理.刪除 --------------------------------------------------------------------------
DROP PREPARE preStmt ;
DEALLOCATE PREPARE preStmt ;
-- 預制述句.管理.修改 --------------------------------------------------------------------------
-- 預制述句.管理.查詢.內容是? --------------------------------------------------------------------------
-- 預制述句.管理.查詢.有哪些? --------------------------------------------------------------------------
-- 預制述句.管理.查詢 --------------------------------------------------------------------------


-- 預制述句.應用. ==========================================================================
/* 預制述句.應用.設定參數--------------------------------------------------------------------------
 * SET @<變數名稱> = <變數值>
 */
 SET @userName = "root";
 SET @userName = NULL;		-- 刪除變數
 SELECT @userName, @notExistVariable;
 
/* 預制述句.應用.執行 --------------------------------------------------------------------------
 * EXECUTE <預制述句名稱> 
 * [USING <變數1>[, <變數2>...]
 * ;
 *
 * 未提供<變數>時, 會以 null 補上 {佔位符}
 * <變數>不能直接使用值
 * <預制述句>有參數, 執行時不提供, 是 error.1210
 * <預制述句>有參數, 執行時提供, 但值為 null 時, 不會error, 但結果可能是 0 筆
 */
 EXECUTE preStmt;
 EXECUTE preStmt USING @userName ;
 -- EXECUTE preStmt USING "root" ;
 